import random

def get_status(score: int) -> str:
    if score <= 10:
        return random.choice([
            "תישן טוב הלילה 😴",
            "לך לישון, מחר עבודה",
            "שקט חשוד",
            "הדבר הכי מסוכן כרגע זה הפקקים בבוקר",
            "אפילו קבוצת הוואטסאפ של הבניין שקטה"
        ])
    if score <= 25:
        return random.choice([
            "לך לישון, הכל בסדר",
            "הכל רגיל. בערך.",
            "אפשר להוריד רגע את החדשות",
            "עוד ערב רגיל במזרח התיכון",
            "הדבר היחיד שמתפוצץ פה זה הפופקורן",
            "ירוק כמו הדשא של השכן."
        ])
    if score <= 40:
        return random.choice([
            "אפשר לנשום. בינתיים.",
            "אולי תשאיר את הטלפון על צליל",
            "תבדוק איפה הפנס. סתם לידע כללי.",
            "לא דרמה, אבל לא משעמם",
            "כדאי להציץ בחדשות מדי פעם",
            "דרוך כמו קפיץ של מזרן ישן",
        ])
    if score <= 55:
        return random.choice([
            "תכין את הקיט, אבל אל תפנה את הבית",
            "מתחיל להיות מעניין. או מלחיץ. תלוי בך",
            "גבולי כמו חופשה בסיני באוגוסט",
            "אולי תוודא שיש סוללות בפנס",
            "רק ליתר ביטחון, כן?"
        ])
    if score <= 55:
        return random.choice([
            "תכין את הקיט, אבל אל תפנה את הבית",
            "מתחיל להיות מעניין. או מלחיץ. תלוי בך",
            "גבולי כמו חופשה בסיני באוגוסט",
            "תבדוק שיש מים בבית",
            "רק ליתר ביטחון, כן?"
        ])
    if score <= 70:
        return random.choice([
            "אולי תמלא את המיכל?",
            "הפסקת החשמל בדרך? או שזה רק הפיוז שלי?",
            "טונה, מים, וסוללות",
            "תבדוק שיש מים בבית",
            "תטעין את הטלפון"
        ])
    if score <= 85:
        return random.choice([
            "קנה טונה עכשיו!!!",
            "השמועות בטלגרם אמינות כמו הורוסקופ, אבל למי אכפת?",
            "תתחיל להתאמן על ריצה למרחקים קצרים (לממ\"ד)",
            "מצב 'וואי וואי' הופעל."
        ])
    return random.choice([
        "📦 הכל לממ\"ד. עכשיו.",
        "יאללה לממ״ד",
        "רמת פאניקה: לקנות את כל המדף של הפסטה",
        "נו באמת",
        "מי הדליק את המזרח התיכון?"
    ])